In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('./Dataset salary 2024.csv')
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2024,SE,FT,AI Engineer,202730,USD,202730,US,0,US,M
1,2024,SE,FT,AI Engineer,92118,USD,92118,US,0,US,M
2,2024,SE,FT,Data Engineer,130500,USD,130500,US,0,US,M
3,2024,SE,FT,Data Engineer,96000,USD,96000,US,0,US,M
4,2024,SE,FT,Machine Learning Engineer,190000,USD,190000,US,0,US,M

In [3]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16534 entries, 0 to 16533
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           16534 non-null  int64
 1   experience_level    16534 non-null  object
 2   employment_type     16534 non-null  object
 3   job_title           16534 non-null  object
 4   salary              16534 non-null  int64
 5   salary_currency     16534 non-null  object
 6   salary_in_usd       16534 non-null  int64
 7   employee_residence  16534 non-null  object
 8   remote_ratio        16534 non-null  int64
 9   company_location    16534 non-null  object
 10  company_size        16534 non-null  object
dtypes: int64(4), object(7)
memory usage: 1.4+ MB

# EDA

### Categorical Data

1. Extract Categorical columns

In [5]:
categorical_cols = [col for col in df.columns if df[col].dtype=='object']
categorical_cols

['experience_level',
 'employment_type',
 'job_title',
 'salary_currency',
 'employee_residence',
 'company_location',
 'company_size']

In [6]:

for col in categorical_cols:
    print(col,df[col].nunique())
    # print(df[col].value_counts())

experience_level 4
employment_type 4
job_title 155
salary_currency 23
employee_residence 88
company_location 77
company_size 3

except experience level ,employment types and compnay size , all columns have many categories

Nomial categories (No Order):

    - employment type : full time (ft),part time(pt),contract {ct},freeelance (FL) which dont make snese in order

    - job titles we have many job roles

    - employee residence is also nomial which has different places info

    - company location , alos nomial data

    - salary currency cod is nomial

Ordinal data (order):

    - experience level has order , Entry level (EN), Mid Level (MI), Senior level (SE), Executive level (EX)

    - company size have Small S,medium M, lagre L

2. finidng the missing values and filling it

In [7]:
for col in categorical_cols:
    print(col,df[col].isna().sum())

experience_level 0
employment_type 0
job_title 0
salary_currency 0
employee_residence 0
company_location 0
company_size 0

so no missing values

3. standardizing the values if inconsistent

In [8]:
df[categorical_cols[0]].value_counts()

experience_level
SE    10670
MI     4038
EN     1325
EX      501
Name: count, dtype: int64

In [9]:
df[categorical_cols[1]].value_counts()

employment_type
FT    16454
PT       38
CT       28
FL       14
Name: count, dtype: int64

In [10]:
df[categorical_cols[2]].value_counts()

job_title
Data Engineer                3464
Data Scientist               3314
Data Analyst                 2440
Machine Learning Engineer    1705
Research Scientist            531
                             ...
BI Data Engineer                1
Marketing Data Engineer         1
Data Science Tech Lead          1
Principal Data Architect        1
Cloud Data Architect            1
Name: count, Length: 155, dtype: int64

In [11]:
df[categorical_cols[3]].value_counts()

salary_currency
USD    15294
GBP      616
EUR      449
CAD       56
INR       55
AUD       12
CHF        8
PLN        7
SGD        6
BRL        5
DKK        4
JPY        4
TRY        3
HUF        3
ILS        2
NOK        2
THB        2
PHP        1
NZD        1
HKD        1
ZAR        1
MXN        1
CLP        1
Name: count, dtype: int64

In [12]:
df[categorical_cols[4]].value_counts()

employee_residence
US    14467
GB      686
CA      453
ES      137
DE       98
      ...
IQ        1
BG        1
JE        1
RS        1
LU        1
Name: count, Length: 88, dtype: int64

In [13]:
categorical_cols

['experience_level',
 'employment_type',
 'job_title',
 'salary_currency',
 'employee_residence',
 'company_location',
 'company_size']

In [14]:
df[categorical_cols[5]].value_counts()

company_location
US    14518
GB      694
CA      455
ES      133
DE      105
      ...
DZ        1
IQ        1
CN        1
CL        1
MD        1
Name: count, Length: 77, dtype: int64

In [15]:
df[categorical_cols[6]].value_counts()

company_size
M    15306
L     1040
S      188
Name: count, dtype: int64

Assuming that data has no inconsistent labels here, all are consistent

In [16]:
for col in categorical_cols:
    print(col,df[col].nunique())

experience_level 4
employment_type 4
job_title 155
salary_currency 23
employee_residence 88
company_location 77
company_size 3

except 3 columns ,all have more categories

and that columns are Nominal, we cant make that many dummies which leads many fetaures/dimensions by one hot encoding 

so we have options like grouping, frequency or target encoding

for > categories it best not to do one hot encoding

if tree based lagorithms no need of encoding , but doing Regression model with lines so , we need to do his step correctly



grouping - i will group rarely used categories as one category

Frequency encoding for the other

In [17]:
df['job_title'].value_counts()

job_title
Data Engineer                3464
Data Scientist               3314
Data Analyst                 2440
Machine Learning Engineer    1705
Research Scientist            531
                             ...
BI Data Engineer                1
Marketing Data Engineer         1
Data Science Tech Lead          1
Principal Data Architect        1
Cloud Data Architect            1
Name: count, Length: 155, dtype: int64

as we can see there are >150 unique values so doing frequency encoding and normalizing it

In [18]:
freq_encoding = df['job_title'].value_counts(normalize=True)
df['job_title_freq'] = df['job_title'].map(freq_encoding)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16534 entries, 0 to 16533
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           16534 non-null  int64
 1   experience_level    16534 non-null  object
 2   employment_type     16534 non-null  object
 3   job_title           16534 non-null  object
 4   salary              16534 non-null  int64
 5   salary_currency     16534 non-null  object
 6   salary_in_usd       16534 non-null  int64
 7   employee_residence  16534 non-null  object
 8   remote_ratio        16534 non-null  int64
 9   company_location    16534 non-null  object
 10  company_size        16534 non-null  object
 11  job_title_freq      16534 non-null  float64
dtypes: float64(1), int64(4), object(7)
memory usage: 1.5+ MB

In [20]:
freq_encoding1 = df['employee_residence'].value_counts(normalize=True)
df['employee_residence_freq'] = df['employee_residence'].map(freq_encoding1)

In [21]:
freq_encoding2 = df['company_location'].value_counts(normalize=True)
df['company_location_freq'] = df['company_location'].map(freq_encoding2)

In [22]:
print(df['experience_level'].value_counts())
print(df['employment_type'].value_counts())
print(df['company_size'].value_counts())

experience_level
SE    10670
MI     4038
EN     1325
EX      501
Name: count, dtype: int64
employment_type
FT    16454
PT       38
CT       28
FL       14
Name: count, dtype: int64
company_size
M    15306
L     1040
S      188
Name: count, dtype: int64

In [23]:
df['experience_level_encode']=df['experience_level'].map({'EN':1,'MI':2,'SE':3,'EX':4})
df['company_size_encode']=df['company_size'].map({'S':1,'M':2,"L":3})

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16534 entries, 0 to 16533
Data columns (total 16 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   work_year                16534 non-null  int64
 1   experience_level         16534 non-null  object
 2   employment_type          16534 non-null  object
 3   job_title                16534 non-null  object
 4   salary                   16534 non-null  int64
 5   salary_currency          16534 non-null  object
 6   salary_in_usd            16534 non-null  int64
 7   employee_residence       16534 non-null  object
 8   remote_ratio             16534 non-null  int64
 9   company_location         16534 non-null  object
 10  company_size             16534 non-null  object
 11  job_title_freq           16534 non-null  float64
 12  employee_residence_freq  16534 non-null  float64
 13  company_location_freq    16534 non-null  float64
 14  experience_level_encode  16534 non-null  int64
 15  company_size_encode      16534 non-null  int64
dtypes: float64(3), int64(6), object(7)
memory usage: 2.0+ MB

In [25]:
categorical_cols

['experience_level',
 'employment_type',
 'job_title',
 'salary_currency',
 'employee_residence',
 'company_location',
 'company_size']

anyway salary there in usd so , no taking consideration of the slaray currncy, and one hot encoding i will do for the employment type

In [26]:
df_dummies = pd.get_dummies(df['employment_type'],drop_first=True)
df=pd.concat([df,df_dummies],axis=1)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16534 entries, 0 to 16533
Data columns (total 19 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   work_year                16534 non-null  int64
 1   experience_level         16534 non-null  object
 2   employment_type          16534 non-null  object
 3   job_title                16534 non-null  object
 4   salary                   16534 non-null  int64
 5   salary_currency          16534 non-null  object
 6   salary_in_usd            16534 non-null  int64
 7   employee_residence       16534 non-null  object
 8   remote_ratio             16534 non-null  int64
 9   company_location         16534 non-null  object
 10  company_size             16534 non-null  object
 11  job_title_freq           16534 non-null  float64
 12  employee_residence_freq  16534 non-null  float64
 13  company_location_freq    16534 non-null  float64
 14  experience_level_encode  16534 non-null  int64
 15  company_size_encode      16534 non-null  int64
 16  FL                       16534 non-null  bool
 17  FT                       16534 non-null  bool
 18  PT                       16534 non-null  bool
dtypes: bool(3), float64(3), int64(6), object(7)
memory usage: 2.1+ MB